wrk/output/stage_4/2_put_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 3.555ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.455ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.300ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.172ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.50ms  801.00us  17.34ms   91.02%
    Req/Sec   263.36     56.28   700.00     56.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.40ms
 75.000%    1.72ms
 90.000%    2.05ms
 99.000%    4.53ms
 99.900%   10.58ms
 99.990%   15.41ms
 99.999%   17.36ms
100.000%   17.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.290     0.000000            1         1.00
       0.863     0.100000         2008         1.11
       1.034     0.200000         4001         1.25
       1.170     0.300000         6003         1.43
       1.288     0.400000         8000         1.67
       1.399     0.500000        10012         2.00
       1.455     0.550000        11001         2.22
       1.512     0.600000        12001         2.50
       1.573     0.650000        12996         2.86
       1.641     0.700000        14001         3.33
       1.715     0.750000        15001         4.00
       1.757     0.775000        15507         4.44
       1.801     0.800000        16006         5.00
       1.851     0.825000        16497         5.71
       1.907     0.850000        16998         6.67
       1.969     0.875000        17496         8.00
       2.007     0.887500        17746         8.89
       2.053     0.900000        18002        10.00
       2.101     0.912500        18244        11.43
       2.153     0.925000        18494        13.33
       2.217     0.937500        18748        16.00
       2.263     0.943750        18872        17.78
       2.317     0.950000        18994        20.00
       2.403     0.956250        19122        22.86
       2.493     0.962500        19246        26.67
       2.625     0.968750        19370        32.00
       2.741     0.971875        19431        35.56
       2.845     0.975000        19495        40.00
       3.025     0.978125        19557        45.71
       3.251     0.981250        19619        53.33
       3.547     0.984375        19681        64.00
       3.753     0.985938        19712        71.11
       4.009     0.987500        19744        80.00
       4.311     0.989062        19775        91.43
       4.651     0.990625        19806       106.67
       5.215     0.992188        19837       128.00
       5.559     0.992969        19853       142.22
       5.951     0.993750        19869       160.00
       6.447     0.994531        19884       182.86
       6.791     0.995313        19901       213.33
       7.215     0.996094        19915       256.00
       7.423     0.996484        19923       284.44
       7.663     0.996875        19931       320.00
       7.891     0.997266        19939       365.71
       8.055     0.997656        19947       426.67
       8.543     0.998047        19954       512.00
       9.095     0.998242        19958       568.89
       9.327     0.998437        19962       640.00
       9.943     0.998633        19966       731.43
      10.191     0.998828        19970       853.33
      11.127     0.999023        19974      1024.00
      11.207     0.999121        19976      1137.78
      11.975     0.999219        19978      1280.00
      12.167     0.999316        19980      1462.86
      12.295     0.999414        19982      1706.67
      12.647     0.999512        19984      2048.00
      12.919     0.999561        19985      2275.56
      12.935     0.999609        19986      2560.00
      12.959     0.999658        19987      2925.71
      13.431     0.999707        19988      3413.33
      14.015     0.999756        19989      4096.00
      14.015     0.999780        19989      4551.11
      15.295     0.999805        19990      5120.00
      15.295     0.999829        19990      5851.43
      15.407     0.999854        19991      6826.67
      15.407     0.999878        19991      8192.00
      15.407     0.999890        19991      9102.22
      16.255     0.999902        19992     10240.00
      16.255     0.999915        19992     11702.86
      16.255     0.999927        19992     13653.33
      16.255     0.999939        19992     16384.00
      16.255     0.999945        19992     18204.44
      17.359     0.999951        19993     20480.00
      17.359     1.000000        19993          inf
#[Mean    =        1.496, StdDeviation   =        0.801]
#[Max     =       17.344, Total count    =        19993]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30003 requests in 30.00s, 2.38MB read
Requests/sec:    999.97
Transfer/sec:     81.07KB