wrk/output/stage_4/3_get_full_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.140ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.149ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.952ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.972ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.69ms    1.78ms  35.30ms   94.55%
    Req/Sec   263.93     68.25     1.22k    94.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    1.73ms
 90.000%    2.26ms
 99.000%   10.14ms
 99.900%   21.52ms
 99.990%   29.52ms
 99.999%   35.33ms
100.000%   35.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.232     0.000000            1         1.00
       0.780     0.100000         2006         1.11
       0.970     0.200000         4015         1.25
       1.116     0.300000         6013         1.43
       1.239     0.400000         8001         1.67
       1.361     0.500000        10000         2.00
       1.423     0.550000        11003         2.22
       1.486     0.600000        12002         2.50
       1.559     0.650000        13006         2.86
       1.637     0.700000        14009         3.33
       1.727     0.750000        15005         4.00
       1.777     0.775000        15505         4.44
       1.831     0.800000        16003         5.00
       1.896     0.825000        16504         5.71
       1.978     0.850000        17001         6.67
       2.091     0.875000        17504         8.00
       2.157     0.887500        17748         8.89
       2.259     0.900000        18002        10.00
       2.391     0.912500        18249        11.43
       2.647     0.925000        18497        13.33
       3.083     0.937500        18747        16.00
       3.383     0.943750        18872        17.78
       3.747     0.950000        18997        20.00
       4.147     0.956250        19122        22.86
       4.575     0.962500        19248        26.67
       5.043     0.968750        19373        32.00
       5.287     0.971875        19435        35.56
       5.635     0.975000        19497        40.00
       6.223     0.978125        19559        45.71
       6.867     0.981250        19622        53.33
       7.883     0.984375        19684        64.00
       8.295     0.985938        19716        71.11
       8.863     0.987500        19747        80.00
       9.647     0.989062        19778        91.43
      10.679     0.990625        19809       106.67
      11.935     0.992188        19841       128.00
      12.247     0.992969        19856       142.22
      12.623     0.993750        19873       160.00
      13.439     0.994531        19887       182.86
      14.407     0.995313        19903       213.33
      15.607     0.996094        19918       256.00
      16.351     0.996484        19926       284.44
      16.559     0.996875        19934       320.00
      17.087     0.997266        19942       365.71
      17.983     0.997656        19950       426.67
      18.527     0.998047        19957       512.00
      18.959     0.998242        19961       568.89
      20.063     0.998437        19965       640.00
      20.319     0.998633        19969       731.43
      21.327     0.998828        19973       853.33
      21.695     0.999023        19977      1024.00
      21.935     0.999121        19979      1137.78
      22.047     0.999219        19981      1280.00
      22.287     0.999316        19983      1462.86
      24.735     0.999414        19986      1706.67
      24.831     0.999512        19987      2048.00
      25.039     0.999561        19988      2275.56
      25.199     0.999609        19989      2560.00
      25.663     0.999658        19990      2925.71
      27.599     0.999707        19991      3413.33
      27.807     0.999756        19992      4096.00
      27.807     0.999780        19992      4551.11
      28.015     0.999805        19993      5120.00
      28.015     0.999829        19993      5851.43
      29.519     0.999854        19994      6826.67
      29.519     0.999878        19994      8192.00
      29.519     0.999890        19994      9102.22
      33.183     0.999902        19995     10240.00
      33.183     0.999915        19995     11702.86
      33.183     0.999927        19995     13653.33
      33.183     0.999939        19995     16384.00
      33.183     0.999945        19995     18204.44
      35.327     0.999951        19996     20480.00
      35.327     1.000000        19996          inf
#[Mean    =        1.693, StdDeviation   =        1.781]
#[Max     =       35.296, Total count    =        19996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30003 requests in 30.01s, 2.49MB read
Requests/sec:    999.92
Transfer/sec:     84.83KB