wrk/output/stage_4/4_delete_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.522ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.034ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.391ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.958ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.57ms    1.15ms  23.78ms   94.78%
    Req/Sec   263.59     60.39   700.00     58.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.41ms
 75.000%    1.76ms
 90.000%    2.15ms
 99.000%    6.74ms
 99.900%   14.17ms
 99.990%   19.89ms
 99.999%   23.79ms
100.000%   23.79ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.230     0.000000            1         1.00
       0.791     0.100000         2006         1.11
       0.988     0.200000         3999         1.25
       1.144     0.300000         6005         1.43
       1.273     0.400000         8017         1.67
       1.411     0.500000        10009         2.00
       1.474     0.550000        11005         2.22
       1.541     0.600000        12002         2.50
       1.608     0.650000        13002         2.86
       1.678     0.700000        13997         3.33
       1.761     0.750000        14999         4.00
       1.808     0.775000        15493         4.44
       1.857     0.800000        15994         5.00
       1.918     0.825000        16493         5.71
       1.987     0.850000        16994         6.67
       2.061     0.875000        17494         8.00
       2.101     0.887500        17750         8.89
       2.155     0.900000        17993        10.00
       2.219     0.912500        18242        11.43
       2.293     0.925000        18495        13.33
       2.413     0.937500        18741        16.00
       2.495     0.943750        18866        17.78
       2.631     0.950000        18993        20.00
       2.869     0.956250        19115        22.86
       3.171     0.962500        19241        26.67
       3.489     0.968750        19365        32.00
       3.701     0.971875        19429        35.56
       4.003     0.975000        19492        40.00
       4.331     0.978125        19552        45.71
       4.739     0.981250        19615        53.33
       5.395     0.984375        19677        64.00
       5.723     0.985938        19708        71.11
       6.091     0.987500        19740        80.00
       6.491     0.989062        19771        91.43
       6.955     0.990625        19802       106.67
       7.483     0.992188        19833       128.00
       7.775     0.992969        19849       142.22
       8.223     0.993750        19865       160.00
       8.703     0.994531        19880       182.86
       9.095     0.995313        19896       213.33
      10.151     0.996094        19911       256.00
      10.455     0.996484        19919       284.44
      10.871     0.996875        19928       320.00
      11.351     0.997266        19935       365.71
      11.711     0.997656        19943       426.67
      12.383     0.998047        19950       512.00
      13.055     0.998242        19954       568.89
      13.359     0.998437        19958       640.00
      13.655     0.998633        19962       731.43
      13.999     0.998828        19966       853.33
      14.399     0.999023        19970      1024.00
      14.559     0.999121        19972      1137.78
      14.711     0.999219        19974      1280.00
      15.359     0.999316        19976      1462.86
      16.591     0.999414        19978      1706.67
      16.767     0.999512        19980      2048.00
      16.975     0.999561        19981      2275.56
      17.151     0.999609        19982      2560.00
      17.183     0.999658        19983      2925.71
      17.631     0.999707        19984      3413.33
      17.711     0.999756        19985      4096.00
      17.711     0.999780        19985      4551.11
      19.311     0.999805        19986      5120.00
      19.311     0.999829        19986      5851.43
      19.887     0.999854        19987      6826.67
      19.887     0.999878        19987      8192.00
      19.887     0.999890        19987      9102.22
      20.447     0.999902        19988     10240.00
      20.447     0.999915        19988     11702.86
      20.447     0.999927        19988     13653.33
      20.447     0.999939        19988     16384.00
      20.447     0.999945        19988     18204.44
      23.791     0.999951        19989     20480.00
      23.791     1.000000        19989          inf
#[Mean    =        1.572, StdDeviation   =        1.147]
#[Max     =       23.776, Total count    =        19989]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30000 requests in 30.00s, 2.40MB read
Requests/sec:    999.93
Transfer/sec:     82.05KB